@prefix : <https://w3id.org/akn/ontology/undo/> .
@prefix dc: <http://purl.org/dc/elements/1.1/> .
@prefix oa: <http://www.w3.org/ns/oa#> .
@prefix lan: <http://id.loc.gov/vocabulary/iso639-1/> .
@prefix owl: <http://www.w3.org/2002/07/owl#> .
@prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix xml: <http://www.w3.org/XML/1998/namespace> .
@prefix xsd: <http://www.w3.org/2001/XMLSchema#> .
@prefix frbr: <http://purl.org/vocab/frbr/core#> .
@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .
@prefix skos: <http://www.w3.org/2004/02/skos/core#> .
@prefix fabio: <http://purl.org/spar/fabio/> .
@prefix dcterms: <http://purl.org/spar/dcterms/> .
@prefix fedregs: <http://www.example.com/fedregs/> .

<https://w3id.org/akn/ontology/undo> a owl:Ontology ;
	owl:versionIRI :2017-02-13 ;
	owl:imports <https://w3id.org/akn/ontology/allot/2017-01-31> , <http://www.w3.org/ns/oa#> , <http://purl.org/spar/frbr> , <http://purl.org/spar/fabio/> , <http://www.w3.org/2004/02/skos/core> ;
	rdfs:comment "The United Nations Document Ontology (UNDO) is an OWL 2 DL ontology that aims at providing a framework for the description of all entities and the relations that are explicitly or implicitly introduced within United Nations documents (normative documents, legal documents, etc.)."@en ;
	<http://purl.org/vocab/vann/preferredNamespacePrefix> "undo" ;
	rdfs:label "UNDO"@en ;
	dc:title "The United Nations Document Ontology (UNDO)"@en ;
	dc:creator "Silvio Peroni (http://orcid.org/0000-0003-0530-4305)" ;
	<http://purl.org/vocab/vann/preferredNamespaceUri> "https://w3id.org/akn/ontology/undo/" ;
	dc:description """The documents published by the United Nation (normative documents, legal documents, etc.) are full of references to real-world objects and concepts, such as other documents, people, organisations, legal terms, and roles. Such entities are clearly linked with the actual content of the document, even by means of different terms, since UN documents are written in six different languages: Arabic, Chinese, English, French, Russian, Spanish. 

The United Nations Document Ontology is an OWL 2 DL ontology that aims at providing a framework for the description of all these entities and the relations that can exists among them. These entities and relations are, thus, implicitly defined by the content of the document in consideration, and typically can concern at least one of the following layers:

1. document-oriented layer, which allows the creation of direct links from a document (or a specific version of it) to other relevant entities that are mentioned within;
2. entity-oriented layer, which enables the identification of entities cited in the document content (e.g. organisations) acting with other relevant entities (people, events, organizations, etc.);
3. content-oriented layer, which provides a specific semantics to all the terms identified in the document content.
 
The document (or any of its parts) can be explicitly annotated by someone with all these relations in order to create a formal connection between the text and the entities its introduces.

The following figure contains a [Graffoo diagram](http://www.essepuntato.it/graffoo) that provides an overview of the class and properties introduced in UNDO.

![A Graffoo diagram of UNDO](undo.png)

The current version of the ontology reuses, extends, and imports several entities defined in external ontologies and vocabularies. In particular, the following ontologies have been considered:

* [ALLOT](https://w3id.org/akn/ontology/allot) provides a formal implementation of Akoma Ntoso Top Level Classes (TLCs) in OWL 2 DL, so as to make available a vocabulary for enabling the integration of heterogeneous legal knowledge-bases based on Akoma Ntoso documents;

* [Web Annotation Ontology](https://www.w3.org/ns/oa) is a set of RDF classes, predicates and named entities that are used by the [Web Annotation Data Model](https://www.w3.org/TR/annotation-model/) for creating annotations in RDF;

* [FRBR DL](http://purl.org/spar/frbr) is an expression in OWL 2 DL of the basic concepts and relations described in the IFLA report on the [Functional Requirements for Bibliographic Records (FRBR)](http://www.ifla.org/publications/functional-requirements-for-bibliographic-records), also described in [Ian Davis's RDF vocabulary](http://vocab.org/frbr/core);

* [FaBiO](http://purl.org/spar/fabio) is an ontology for recording and publishing on the Semantic Web bibliographic records of scholarly endeavours;

* [SKOS](https://www.w3.org/TR/skos-reference/) is a common data model for sharing and linking knowledge organization systems via the Web.



### Example of use

UNDO can be used for modelling several scenarios that are typical to the documents published by the United Nations (e.g. UN Resolutions). In the following subsections we introduce some of them, and we accompany them with exemplar instantiations. 

The prefixes that are used in all the examples provided below are defined as follows:

    @prefix : <https://w3id.org/akn/data/undo/> .
    @prefix undo: <https://w3id.org/akn/ontology/undo/> .
    @prefix allot: <https://w3id.org/akn/ontology/allot/> .
    @prefix owl: <http://www.w3.org/2002/07/owl#> .
    @prefix dcterms: <http://purl.org/dc/terms/> .
    @prefix lan: <http://id.loc.gov/vocabulary/iso639-1/> .
    @prefix oa: <http://www.w3.org/ns/oa#> .


#### Scenario 1

In the preface of the UN resolution A/RES/50/100 of 2 February 1996 there are references to:

1. the UN resolution A/RES/47/180 of 22 December 1992;
2. the Government of Turkey;
3. the United Nations Conference on Human Settlements (Habitat II).

```
:a-res-50-100-1996-02-02 a undo:UNResolution ;
	allot:mentions
		:a-res-47-180-1992-12-22 ,
		:government-of-turkey ,
		:habitat-ii .

:a-res-47-180-1992-12-22 a undo:UNResolution .

:government-of-turkey a allot:Organization .

:habitat-ii a allot:Event .
```


#### Scenario 2

According to the content of the UN resolution A/RES/50/100 of 2 February 1996, the General Assembly:

1. recalls the resolution A/RES/47/180 of 22 December 1992;
2. reiterates its gratitude to the Government of Turkey;
3. notes the progress that has been made so far in the preparations for the United Nations Conference on Human Settlements (Habitat II).

```
:a-res-50-100-1996-02-02 a undo:UNResolution .

:a-res-47-180-1992-12-22 a undo:UNResolution .

:general-assembly a allot:Organization .

:organization a allot:Organization .

:government-of-turkey a allot:Organization .

:habitat-ii a allot:Event .

:recall a allot:Concept .

:reiterate-its-gratitude a allot:Concept .

:note-the-progress a allot:Concept .

:relation-1 a undo:Relation ;
	undo:hasProponent :general-assembly ;
	undo:hasSemantics :recall ;
	undo:hasReceiver :a-res-47-180-1992-12-22 .

:relation-2 a undo:Relation ;
	undo:hasProponent :general-assembly ;
	undo:hasSemantics :reiterate-its-gratitude ;
	undo:hasReceiver :government-of-turkey .

:relation-3 a undo:Relation ;
	undo:hasProponent :general-assembly ;
	undo:hasSemantics :note-the-progress ;
	undo:hasReceiver :habitat-ii .

:annotation-1-a-res-50-100-1996-02-02 a undo:Annotation ;
    oa:hasBody :relation-1 ;
    oa:hasTarget :a-res-50-100-1996-02-02 .

:annotation-2-a-res-50-100-1996-02-02 a undo:Annotation ;
    oa:hasBody :relation-2 ;
    oa:hasTarget :a-res-50-100-1996-02-02 .

:annotation-3-a-res-50-100-1996-02-02 a undo:Annotation ;
    oa:hasBody :relation-3 ;
    oa:hasTarget :a-res-50-100-1996-02-02 .
```

#### Scenario 3

The UN resolution A/RES/50/100 has been published in six different languages. The term \"decides\" has been used twice in the English version, and, in parallel, the term \"decide\" has been used twice in the Spanish version. Both the terms actually refers to the same higher-level concept of taking a decision, even if this aspect has not been made formally explicit in the document itself.

```
:a-res-50-100-1996-02-02 a undo:UNResolution ;
    allot:hasRealization
        :a-res-50-100-1996-02-02-en ,
        :a-res-50-100-1996-02-02-es .

:a-res-50-100-1996-02-02-en a undo:UNDocumentVersion ;
    dcterms:language lan:en .

:a-res-50-100-1996-02-02-es a undo:UNDocumentVersion ;
    dcterms:language lan:es .

:decides a allot:Term ;
    undo:hasRelatedConcept :taking-a-decision .

:annotation-1-a-res-50-100-1996-02-02-en a undo:Annotation ;
    oa:hasBody :decides ;
    oa:hasTarget :a-res-50-100-1996-02-02-en .

:annotation-2-a-res-50-100-1996-02-02-en a undo:Annotation ;
    oa:hasBody :decides ;
    oa:hasTarget :a-res-50-100-1996-02-02-en .

:decide a allot:Term ;
    undo:hasRelatedConcept :taking-a-decision .

:annotation-1-a-res-50-100-1996-02-02-es a undo:Annotation ;
    oa:hasBody :decide ;
    oa:hasTarget :a-res-50-100-1996-02-02-es .

:annotation-2-a-res-50-100-1996-02-02-es a undo:Annotation ;
    oa:hasBody :decide ;
    oa:hasTarget :a-res-50-100-1996-02-02-es .

:taking-a-decision a allot:Concept .
```


### Competency questions

UNDO can be used for answering several questions related to the content of the documents published by the United Nations (e.g. UN Resolutions). In the following subsections we introduce some of them, and we accompany them with exemplar SPARQL queries. 

The prefixes that are used in all the SPARQL queries provided below are defined as follows:

    PREFIX : <https://w3id.org/akn/data/undo/>
    PREFIX allot: <https://w3id.org/akn/ontology/allot/>
    PREFIX oa: <http://www.w3.org/ns/oa#>
    PREFIX owl: <http://www.w3.org/2002/07/owl#>
    PREFIX undo: <https://w3id.org/akn/ontology/undo/>

#### Question 1

What are all the documents that refer to the UN resolution A/RES/47/180 of 22 December 1992?

    SELECT DISTINCT ?document
    WHERE {
        ?document allot:mentions :a-res-47-180-1992-12-22 .
    }


#### Question 2

What are all the entities referred by the UN resolution A/RES/50/100 of 2 February 1996?

    SELECT DISTINCT ?entity ?type
    WHERE {
        :a-res-50-100-1996-02-02 allot:mentions ?entity .
        ?entity a ?type .
        FILTER (?type != owl:NamedIndividual)
    }


#### Question 3

What are the documents that describes the General Assembly recalling the resolution A/RES/47/180 of 22 December 1992?

    SELECT DISTINCT ?document
    WHERE {
        ?rel a undo:Relation ;
            undo:hasProponent :general-assembly ;
            undo:hasSemantics :recall ;
            undo:hasReceiver :a-res-47-180-1992-12-22 .
        
        ?ann a undo:Annotation ;
            oa:hasBody ?rel ;
            oa:hasTarget ?document
    }


#### Question 4

What are all the terms that actually refer to the concept of taking a decision, and in which documents have been used?

    SELECT DISTINCT ?term ?document
    WHERE {
        ?term a allot:Term ;
            undo:hasRelatedConcept :taking-a-decision .
           
        ?ann a undo:Annotation ;
            oa:hasBody ?term ;
            oa:hasTarget ?document
    }"""@en ;
	owl:versionInfo "February 13, 2017"@en .
# 
# 
# #################################################################
# #
# #    Annotation properties
# #
# #################################################################
# 
# 
# http://purl.org/dc/terms/description

<http://purl.org/dc/terms/description> a owl:AnnotationProperty .
# 
# 
# 
# #################################################################
# #
# #    Object Properties
# #
# #################################################################
# 
# 
# http://purl.org/dc/terms/language

<http://purl.org/dc/terms/language> a owl:ObjectProperty .
# 
# http://www.w3.org/ns/oa#hasBody

oa:hasBody a owl:ObjectProperty .
# 
# http://www.w3.org/ns/oa#hasTarget

oa:hasTarget a owl:ObjectProperty .
# 
# https://w3id.org/akn/ontology/allot/hasEmbodiment

<https://w3id.org/akn/ontology/allot/hasEmbodiment> rdfs:subPropertyOf frbr:embodiment .
# 
# https://w3id.org/akn/ontology/allot/hasExemplar

<https://w3id.org/akn/ontology/allot/hasExemplar> rdfs:subPropertyOf frbr:exemplar .
# 
# https://w3id.org/akn/ontology/allot/hasRealization

<https://w3id.org/akn/ontology/allot/hasRealization> a owl:ObjectProperty ;
	rdfs:subPropertyOf frbr:realization .
# 
# https://w3id.org/akn/ontology/allot/mentions

<https://w3id.org/akn/ontology/allot/mentions> a owl:ObjectProperty .
# 
# https://w3id.org/akn/ontology/undo/hasProponent

:hasProponent a owl:ObjectProperty ;
	rdfs:subPropertyOf <https://w3id.org/akn/ontology/allot/hasRelatedReference> ;
	rdfs:domain :Relation ;
	rdfs:range <https://w3id.org/akn/ontology/allot/Reference> ;
	rdfs:comment "The proponent entity of a relation."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "has proponent"@en .
# 
# https://w3id.org/akn/ontology/undo/hasReceiver

:hasReceiver a owl:ObjectProperty ;
	rdfs:subPropertyOf <https://w3id.org/akn/ontology/allot/hasRelatedReference> ;
	rdfs:domain :Relation ;
	rdfs:range <https://w3id.org/akn/ontology/allot/Reference> ;
	rdfs:comment "The receiver entity of a relation."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "has receiver"@en .
# 
# https://w3id.org/akn/ontology/undo/hasRelatedConcept

:hasRelatedConcept a owl:ObjectProperty ;
	rdfs:subPropertyOf <https://w3id.org/akn/ontology/allot/hasRelatedReference> ;
	rdfs:domain <https://w3id.org/akn/ontology/allot/Term> ;
	rdfs:range <https://w3id.org/akn/ontology/allot/Concept> ;
	rdfs:comment "A concept that is related somehow to a term (e.g. because it represents the meaning of a particular term)."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "has related concept"@en .
# 
# https://w3id.org/akn/ontology/undo/hasSemantics

:hasSemantics a owl:ObjectProperty ;
	rdfs:subPropertyOf <https://w3id.org/akn/ontology/allot/hasRelatedReference> ;
	rdfs:domain :Relation ;
	rdfs:range <https://w3id.org/akn/ontology/allot/Concept> ;
	rdfs:comment "The semantics of a relation."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "has semantics"@en .
# 
# 
# 
# #################################################################
# #
# #    Classes
# #
# #################################################################
# 
# 
# http://www.w3.org/2002/07/owl#Thing

owl:Thing a owl:Class .
# 
# https://w3id.org/akn/ontology/allot/Concept

<https://w3id.org/akn/ontology/allot/Concept> a owl:Class ;
	rdfs:subClassOf skos:Concept .
# 
# https://w3id.org/akn/ontology/allot/Event

<https://w3id.org/akn/ontology/allot/Event> a owl:Class .
# 
# https://w3id.org/akn/ontology/allot/FRBRExpression

<https://w3id.org/akn/ontology/allot/FRBRExpression> rdfs:subClassOf fabio:Expression , _:genid1 .

_:genid1 a owl:Restriction ;
	owl:onProperty <http://purl.org/dc/terms/language> ;
	owl:qualifiedCardinality "1"^^xsd:nonNegativeInteger ;
	owl:onClass :UNOfficialLanguage .
# 
# https://w3id.org/akn/ontology/allot/FRBRItem

<https://w3id.org/akn/ontology/allot/FRBRItem> rdfs:subClassOf frbr:Item .
# 
# https://w3id.org/akn/ontology/allot/FRBRManifestation

<https://w3id.org/akn/ontology/allot/FRBRManifestation> rdfs:subClassOf frbr:Manifestation .
# 
# https://w3id.org/akn/ontology/allot/FRBRWork

<https://w3id.org/akn/ontology/allot/FRBRWork> rdfs:subClassOf fabio:Work .
# 
# https://w3id.org/akn/ontology/allot/Organization

<https://w3id.org/akn/ontology/allot/Organization> a owl:Class .
# 
# https://w3id.org/akn/ontology/allot/Reference

<https://w3id.org/akn/ontology/allot/Reference> a owl:Class .
# 
# https://w3id.org/akn/ontology/allot/Term

<https://w3id.org/akn/ontology/allot/Term> a owl:Class .
# 
# https://w3id.org/akn/ontology/undo/Annotation

:Annotation a owl:Class ;
	rdfs:subClassOf oa:Annotation , <https://w3id.org/akn/ontology/allot/Concept> , _:genid2 .

_:genid2 a owl:Restriction ;
	owl:onProperty oa:hasBody ;
	owl:allValuesFrom <https://w3id.org/akn/ontology/allot/Reference> .

:Annotation rdfs:subClassOf _:genid3 .

_:genid3 a owl:Restriction ;
	owl:onProperty oa:hasTarget ;
	owl:allValuesFrom frbr:Endeavour .

:Annotation rdfs:comment "A mechanism that allows someone to link a specific entity (e.g. a relation) to a target document (or its parts), with the intent of specifying from where that entity has been actually derived from."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "annotation"@en .
# 
# https://w3id.org/akn/ontology/undo/Relation

:Relation a owl:Class ;
	rdfs:subClassOf <https://w3id.org/akn/ontology/allot/Concept> , _:genid4 .

_:genid4 a owl:Restriction ;
	owl:onProperty :hasProponent ;
	owl:cardinality "1"^^xsd:nonNegativeInteger .

:Relation rdfs:subClassOf _:genid5 .

_:genid5 a owl:Restriction ;
	owl:onProperty :hasReceiver ;
	owl:cardinality "1"^^xsd:nonNegativeInteger .

:Relation rdfs:subClassOf _:genid6 .

_:genid6 a owl:Restriction ;
	owl:onProperty :hasSemantics ;
	owl:cardinality "1"^^xsd:nonNegativeInteger .

:Relation rdfs:comment "Something that allows one to link a proponent entity to a receiver entity according to a specific semantics - e.g. saying that a document (proponent) cites (semantics) another document (receiver), or that an organization (proponent) approves (semantics) a certain document (receiver), etc."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "relation"@en .
# 
# https://w3id.org/akn/ontology/undo/UNDocument

:UNDocument a owl:Class ;
	rdfs:subClassOf <https://w3id.org/akn/ontology/allot/FRBRWork> , _:genid7 .

_:genid7 a owl:Restriction ;
	owl:onProperty <https://w3id.org/akn/ontology/allot/hasRealization> ;
	owl:someValuesFrom :UNDocumentVersion .

:UNDocument rdfs:comment "A document of a specific kind (e.g. normative documents, legal documents, etc.) published by the United Nations for certain reasons."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "UN document"@en .
# 
# https://w3id.org/akn/ontology/undo/UNDocumentVersion

:UNDocumentVersion a owl:Class ;
	rdfs:subClassOf <https://w3id.org/akn/ontology/allot/FRBRExpression> , _:genid8 .

_:genid8 a owl:Restriction ;
	owl:onProperty _:genid9 .

_:genid9 owl:inverseOf <https://w3id.org/akn/ontology/allot/hasRealization> .

_:genid8 owl:allValuesFrom :UNDocument .

:UNDocumentVersion rdfs:subClassOf _:genid10 .

_:genid10 a owl:Restriction ;
	owl:onProperty <http://purl.org/dc/terms/language> ;
	owl:qualifiedCardinality "1"^^xsd:nonNegativeInteger ;
	owl:onClass :UNOfficialLanguage .

:UNDocumentVersion rdfs:comment "A particular version of United Nation document written according to a certain language, chosen from the six official United Nation languages."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "UN document version"@en .
# 
# https://w3id.org/akn/ontology/undo/UNOfficialLanguage

:UNOfficialLanguage a owl:Class ;
	owl:equivalentClass _:genid11 .

_:genid11 a owl:Class ;
	owl:oneOf _:genid17 .

_:genid17 a rdf:List ;
	rdf:first lan:ar ;
	rdf:rest _:genid16 .

_:genid16 a rdf:List ;
	rdf:first lan:en ;
	rdf:rest _:genid15 .

_:genid15 a rdf:List ;
	rdf:first lan:es ;
	rdf:rest _:genid14 .

_:genid14 a rdf:List ;
	rdf:first lan:fr ;
	rdf:rest _:genid13 .

_:genid13 a rdf:List ;
	rdf:first lan:ru ;
	rdf:rest _:genid12 .

_:genid12 a rdf:List ;
	rdf:first lan:zh ;
	rdf:rest rdf:nil .

:UNOfficialLanguage rdfs:subClassOf <https://w3id.org/akn/ontology/allot/Concept> ;
	rdfs:comment "A particular language officially adopted by the United Nation for publishing their documents (Arabic, Chinese, English, French, Russian, Spanish)."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "UN official language"@en .
# 
# https://w3id.org/akn/ontology/undo/UNResolution

:UNResolution a owl:Class ;
	rdfs:subClassOf :UNDocument ;
	rdfs:comment "A particular kind of United Nation document that contains a formal expression of the will of a principal or subsidiary organ or other empowered bodies."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "UN resolution"@en .
# 
# 
# 
# #################################################################
# #
# #    Individuals
# #
# #################################################################
# 
# 
# http://id.loc.gov/vocabulary/iso639-1/ar

lan:ar a owl:NamedIndividual , :UNOfficialLanguage ;
	<http://purl.org/dc/terms/description> "This entity representing the Arabic language has been originally defined in the Library of Congress concept scheme (skos:ConceptScheme) available at http://id.loc.gov/vocabulary/iso639-1, which maps all the two-letters codes for languages introduced in the specification ISO 639-1 as Linked Open Data."@en ;
	rdfs:comment "The Arabic is one of the six official languages used for publishing United Nations documents."@en ;
	rdfs:isDefinedBy <http://id.loc.gov/vocabulary/iso639-1> ;
	rdfs:label "Arabic"@en .
# 
# http://id.loc.gov/vocabulary/iso639-1/en

lan:en a owl:NamedIndividual , :UNOfficialLanguage ;
	<http://purl.org/dc/terms/description> "This entity representing the English language has been originally defined in the Library of Congress concept scheme (skos:ConceptScheme) available at http://id.loc.gov/vocabulary/iso639-1, which maps all the two-letters codes for languages introduced in the specification ISO 639-1 as Linked Open Data."@en ;
	rdfs:comment "The English is one of the six official languages used for publishing United Nations documents."@en ;
	rdfs:isDefinedBy <http://id.loc.gov/vocabulary/iso639-1> ;
	rdfs:label "English"@en .
# 
# http://id.loc.gov/vocabulary/iso639-1/es

lan:es a owl:NamedIndividual , :UNOfficialLanguage ;
	<http://purl.org/dc/terms/description> "This entity representing the Spanish language has been originally defined in the Library of Congress concept scheme (skos:ConceptScheme) available at http://id.loc.gov/vocabulary/iso639-1, which maps all the two-letters codes for languages introduced in the specification ISO 639-1 as Linked Open Data."@en ;
	rdfs:comment "The Spanish is one of the six official languages used for publishing United Nations documents."@en ;
	rdfs:isDefinedBy <http://id.loc.gov/vocabulary/iso639-1> ;
	rdfs:label "Spanish"@en .
# 
# http://id.loc.gov/vocabulary/iso639-1/fr

lan:fr a owl:NamedIndividual , :UNOfficialLanguage ;
	<http://purl.org/dc/terms/description> "This entity representing the French language has been originally defined in the Library of Congress concept scheme (skos:ConceptScheme) available at http://id.loc.gov/vocabulary/iso639-1, which maps all the two-letters codes for languages introduced in the specification ISO 639-1 as Linked Open Data."@en ;
	rdfs:comment "The French is one of the six official languages used for publishing United Nations documents."@en ;
	rdfs:isDefinedBy <http://id.loc.gov/vocabulary/iso639-1> ;
	rdfs:label "French"@en .
# 
# http://id.loc.gov/vocabulary/iso639-1/ru

lan:ru a owl:NamedIndividual , :UNOfficialLanguage ;
	<http://purl.org/dc/terms/description> "This entity representing the Russian language has been originally defined in the Library of Congress concept scheme (skos:ConceptScheme) available at http://id.loc.gov/vocabulary/iso639-1, which maps all the two-letters codes for languages introduced in the specification ISO 639-1 as Linked Open Data."@en ;
	rdfs:comment "The Russian is one of the six official languages used for publishing United Nations documents."@en ;
	rdfs:isDefinedBy <http://id.loc.gov/vocabulary/iso639-1> ;
	rdfs:label "Russian"@en .
# 
# http://id.loc.gov/vocabulary/iso639-1/zh

lan:zh a owl:NamedIndividual , :UNOfficialLanguage ;
	<http://purl.org/dc/terms/description> "This entity representing the Chinise language has been originally defined in the Library of Congress concept scheme (skos:ConceptScheme) available at http://id.loc.gov/vocabulary/iso639-1, which maps all the two-letters codes for languages introduced in the specification ISO 639-1 as Linked Open Data."@en ;
	rdfs:comment "The Chinese is one of the six official languages used for publishing United Nations documents."@en ;
	rdfs:isDefinedBy <http://id.loc.gov/vocabulary/iso639-1> ;
	rdfs:label "Chinese"@en .
# 
# Generated by the OWL API (version 4.2.6.20160910-2108) https://github.com/owlcs/owlapi
