@prefix : <https://w3id.org/akn/ontology/undo/> .
@prefix dc: <http://purl.org/dc/elements/1.1/> .
@prefix oa: <http://www.w3.org/ns/oa#> .
@prefix ti: <http://www.ontologydesignpatterns.org/cp/owl/timeinterval.owl#> .
@prefix lan: <http://id.loc.gov/vocabulary/iso639-1/> .
@prefix owl: <http://www.w3.org/2002/07/owl#> .
@prefix pro: <http://purl.org/spar/pro/> .
@prefix pso: <http://purl.org/spar/pso/> .
@prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix tvc: <http://www.essepuntato.it/2012/04/tvc/> .
@prefix xml: <http://www.w3.org/XML/1998/namespace> .
@prefix xsd: <http://www.w3.org/2001/XMLSchema#> .
@prefix frbr: <http://purl.org/vocab/frbr/core#> .
@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .
@prefix skos: <http://www.w3.org/2004/02/skos/core#> .
@prefix fabio: <http://purl.org/spar/fabio/> .
@prefix dcterms: <http://purl.org/spar/dcterms/> .
@prefix lkif-role: <http://www.estrellaproject.org/lkif-core/role.owl#> .
@prefix lkif-action: <http://www.estrellaproject.org/lkif-core/action.owl#> .

<https://w3id.org/akn/ontology/undo> a owl:Ontology ;
	owl:versionIRI :2017-03-08 ;
	owl:imports <https://w3id.org/akn/ontology/allot/2017-01-31> , <http://www.essepuntato.it/2012/04/tvc> , <http://www.w3.org/ns/oa#> , <http://www.ontologydesignpatterns.org/cp/owl/timeinterval.owl> ;
	rdfs:comment "The United Nations Document Ontology (UNDO) is an OWL 2 DL ontology that aims at providing a framework for the description of all entities and the relations that are explicitly or implicitly introduced within United Nations documents (normative documents, legal documents, etc.)."@en ;
	<http://purl.org/vocab/vann/preferredNamespacePrefix> "undo" ;
	dc:description """The parliamentary, normative and legal documents published by the United Nations system of organisations, from now on \"UN documents\", are full of references to real-world objects and concepts, such as other documents, people, organisations, legal terms, and roles. Such entities are linked with the actual content of the document, even by means of different terms being the UN documents often issued in several official languages. 

The United Nations Document Ontology (UNDO, GitHub repository available at https://github.com/essepuntato/undo) is an OWL 2 DL ontology that aims at providing a framework for the description of all these entities and the relations that can exists among them. These entities and relations are, thus, implicitly defined by the content of the document in consideration, and typically can concern at least one of the following layers:

1. document-oriented layer, which allows the creation of direct links from a document (a resolution, a report, etc.) to other relevant entities that are mentioned within;
2. entity-oriented layer, which enables the identification of entities cited in the document content (e.g. organisations) acting with other relevant entities (people, events, organizations, etc.);
3. content-oriented layer, which provides a specific semantics to all the terms identified in the document content.
 
The document (or any of its parts) can be explicitly annotated by someone with all these relations in order to create a formal connection between the text and the entities its introduces.

The following figure contains a [Graffoo diagram](http://www.essepuntato.it/graffoo) that provides an overview of the class and properties introduced in UNDO.

![A Graffoo diagram of UNDO](undo.png)

The current version of the ontology imports several ontologies:

* [ALLOT](https://w3id.org/akn/ontology/allot) provides a formal implementation of Akoma Ntoso Top Level Classes (TLCs) in OWL 2 DL, so as to make available a vocabulary for enabling the integration of heterogeneous legal knowledge-bases based on Akoma Ntoso documents;

* [Time-indexed Value in Context](http://www.essepuntato.it/2012/04/tvc) is an ontology pattern that allows one to describe scenarios in which someone (e.g., a person) has a value (e.g., a particular role) during a particular time and for a particular context;

* [Time Interval](http://www.ontologydesignpatterns.org/cp/owl/timeinterval.owl) is an ontology pattern that enables the description of period of times characterised by a starting date and an ending date;

* [Web Annotation Ontology](https://www.w3.org/ns/oa) is a set of RDF classes, predicates and named entities that are used by the [Web Annotation Data Model](https://www.w3.org/TR/annotation-model/) for creating annotations in RDF;

In addition to these ontologies, UNDO is also aligned with entities defined in external ontologies and vocabularies, in particular:

* [Dublin Core Metadata Terms](http://purl.org/dc/terms/) is an ontology implementing all the metadata terms maintained by the Dublin Core Metadata Initiative, including properties, vocabulary encoding schemes, syntax encoding schemes, and classes;

* [FaBiO](http://purl.org/spar/fabio) is an ontology for recording and publishing on the Semantic Web bibliographic records of scholarly endeavours;

* [FOAF](http://xmlns.com/foaf/0.1/) is an ontology for describing people and their relations with other people, documents, and other information objects;

* [FRBR DL](http://purl.org/spar/frbr) is an expression in OWL 2 DL of the basic concepts and relations described in the IFLA report on the [Functional Requirements for Bibliographic Records (FRBR)](http://www.ifla.org/publications/functional-requirements-for-bibliographic-records), also described in [Ian Davis's RDF vocabulary](http://vocab.org/frbr/core);

* [ISO 639-1](http://id.loc.gov.vocabulary/iso693-1) is a vocabulary describing the first part of the ISO 639 international-standard language-code family;

* [LKIF Core: Action](http://www.estrellaproject.org/lkif-core/action.owl) is an ontology for representing actions in general, i.e. processes which are performed by some agent;

* [LKIF Core: Role](http://www.estrellaproject.org/lkif-core/role.owl) is an ontology for describing typology of roles (epistemic roles, functions, person roles, organisation roles);

* [PRO](http://purl.org/spar/pro) is an ontology describing possible roles in the publication process, or in other scholarly activities or situations, held by particular agent;

* [PSO](http://purl.org/spar/pso) is an ontology for characterizing the publication status of a document or other publication entity at each of the various stages in the publishing process;

* [SKOS](https://www.w3.org/TR/skos-reference/) is a common data model for sharing and linking knowledge organization systems via the Web.

A full version of UNDO, where all the aforementioned ontologies have been imported formally within the ontology, is available at https://w3id.org/akn/ontology/undo-imports, so as to enable advanced automatic reasoning and classification.


### Example of use

UNDO can be used for modelling several scenarios that are typical to the documents published by the United Nations (e.g. UN Resolutions). In the following subsections we introduce some of them, and we accompany them with exemplar instantiations. 

The prefixes that are used in all the examples provided below are defined as follows:

    @prefix : <https://w3id.org/akn/data/undo/> .
    @prefix undo: <https://w3id.org/akn/ontology/undo/> .
    @prefix allot: <https://w3id.org/akn/ontology/allot/> .
    @prefix owl: <http://www.w3.org/2002/07/owl#> .
    @prefix dcterms: <http://purl.org/dc/terms/> .
    @prefix lan: <http://id.loc.gov/vocabulary/iso639-1/> .
    @prefix oa: <http://www.w3.org/ns/oa#> .
    @prefix ti: <http://www.ontologydesignpatterns.org/cp/owl/timeinterval.owl#> .
    @prefix tvc: <http://www.essepuntato.it/2012/04/tvc/> .



#### Scenario 1

In the preface of the UN resolution A/RES/50/100 of 2 February 1996 there are references to:

1. the UN resolution A/RES/47/180 of 22 December 1992;
2. the Government of Turkey;
3. the United Nations Conference on Human Settlements (Habitat II).

```
:a-res-50-100-1996-02-02 a undo:Resolution ;
	allot:mentions
		:a-res-47-180-1992-12-22 ,
		:government-of-turkey ,
		:habitat-ii .

:a-res-47-180-1992-12-22 a undo:Resolution .

:government-of-turkey a allot:Organization .

:habitat-ii a allot:Event .
```


#### Scenario 2

According to the content of the UN resolution A/RES/50/100 of 2 February 1996, the General Assembly:

1. recalls the resolution A/RES/47/180 of 22 December 1992;
2. reiterates its gratitude to the Government of Turkey;
3. notes the progress that has been made so far in the preparations for the United Nations Conference on Human Settlements (Habitat II).

```
:a-res-50-100-1996-02-02 a undo:Resolution .

:a-res-47-180-1992-12-22 a undo:Resolution .

:general-assembly a allot:Organization .

:organization a allot:Organization .

:government-of-turkey a allot:Organization .

:habitat-ii a allot:Event .

:recall a allot:Concept .

:reiterate-its-gratitude a allot:Concept .

:note-the-progress a allot:Concept .

:relation-1 a undo:Relation ;
	undo:hasProponent :general-assembly ;
	undo:hasSemantics :recall ;
	undo:hasReceiver :a-res-47-180-1992-12-22 .

:relation-2 a undo:Relation ;
	undo:hasProponent :general-assembly ;
	undo:hasSemantics :reiterate-its-gratitude ;
	undo:hasReceiver :government-of-turkey .

:relation-3 a undo:Relation ;
	undo:hasProponent :general-assembly ;
	undo:hasSemantics :note-the-progress ;
	undo:hasReceiver :habitat-ii .

:annotation-1-a-res-50-100-1996-02-02 a undo:Annotation ;
    oa:hasBody :relation-1 ;
    oa:hasTarget :a-res-50-100-1996-02-02 .

:annotation-2-a-res-50-100-1996-02-02 a undo:Annotation ;
    oa:hasBody :relation-2 ;
    oa:hasTarget :a-res-50-100-1996-02-02 .

:annotation-3-a-res-50-100-1996-02-02 a undo:Annotation ;
    oa:hasBody :relation-3 ;
    oa:hasTarget :a-res-50-100-1996-02-02 .
```

#### Scenario 3

The UN resolution A/RES/50/100 has been published in six different languages. The term \"decides\" has been used twice in the English version, and, in parallel, the term \"decide\" has been used twice in the Spanish version. Both the terms actually refers to the same higher-level concept of taking a decision, even if this aspect has not been made formally explicit in the document itself.

```
:a-res-50-100-1996-02-02 a undo:Resolution ;
    allot:hasRealization
        :a-res-50-100-1996-02-02-en ,
        :a-res-50-100-1996-02-02-es .

:a-res-50-100-1996-02-02-en a undo:DocumentVersion ;
    dcterms:language lan:en .

:a-res-50-100-1996-02-02-es a undo:DocumentVersion ;
    dcterms:language lan:es .

:decides a allot:Term ;
    undo:hasRelatedConcept :taking-a-decision .

:annotation-1-a-res-50-100-1996-02-02-en a undo:Annotation ;
    oa:hasBody :decides ;
    oa:hasTarget :a-res-50-100-1996-02-02-en .

:annotation-2-a-res-50-100-1996-02-02-en a undo:Annotation ;
    oa:hasBody :decides ;
    oa:hasTarget :a-res-50-100-1996-02-02-en .

:decide a allot:Term ;
    undo:hasRelatedConcept :taking-a-decision .

:annotation-1-a-res-50-100-1996-02-02-es a undo:Annotation ;
    oa:hasBody :decide ;
    oa:hasTarget :a-res-50-100-1996-02-02-es .

:annotation-2-a-res-50-100-1996-02-02-es a undo:Annotation ;
    oa:hasBody :decide ;
    oa:hasTarget :a-res-50-100-1996-02-02-es .

:taking-a-decision a allot:Concept .
```

#### Scenario 4

Giorgio Napolitano has been President of Italy for the first time from the 15th of May 2006 to the 22th of April 2013, when he resigned. He has been elected again on the 22th of April 2013, and he has been President of Italy for the second time by the 14th of January 2015, when he resigned for the second time. He has been substituted by Sergio Mattarella, who starts his mandate as President of Italy on the 3rd of February 2015, formerly judge of the Constitutional Court of Italy from the 11th of October 2011 to the 2nd of February 2015.

```
:giorgio-napolitano a undo:Agent ;
    tvc:hasValue
        :giorgio-napolitano-president-of-italy-2006-2013 ,
        :giorgio-napolitano-president-of-italy-2013-2015 .

:giorgio-napolitano-president-of-italy-2006-2013 a undo:ValueInTimeAndContext ;
    tvc:withValue :president ;
    tvc:atTime :2006-2013 ;
    tvc:withinContext :italy .

:giorgio-napolitano-president-of-italy-2013-2015 a undo:ValueInTimeAndContext ;
    tvc:withValue :president ;
    tvc:atTime :2013-2015 ;
    tvc:withinContext :italy .

:president a allot:Role .

:2006-2013 a undo:Interval ;
    ti:hasIntervalStartDate \"2006-05-15T00:00:00\"^^xsd:dateTime ;
    ti:hasIntervalEndDate \"2013-04-22T00:00:00\"^^xsd:dateTime .

:2013-2015 a undo:Interval ;
    ti:hasIntervalStartDate \"2013-04-22T00:00:00\"^^xsd:dateTime ;
    ti:hasIntervalEndDate \"2015-01-14T00:00:00\"^^xsd:dateTime .

:italy a allot:Reference .

:sergio-mattarella a undo:Agent ;
    tvc:hasValue
        :sergio-mattarella-judge-constitutional-court-of-italy-2011-2015 ,
        :sergio-mattarella-president-of-italy-since-2015.

:sergio-mattarella-judge-constitutional-court-of-italy-2011-2015 a undo:ValueInTimeAndContext ;
    tvc:withValue :judge ;
    tvc:atTime :2011-2015 ;
    tvc:withinContext :constitutional-court-of-italy .

:sergio-mattarella-president-of-italy-since-2015 a undo:ValueInTimeAndContext ;
    tvc:withValue :president ;
    tvc:atTime :since-2015 ;
    tvc:withinContext :italy .

:2011-2015 a undo:Interval ;
    ti:hasIntervalStartDate \"2011-10-11T00:00:00\"^^xsd:dateTime ;
    ti:hasIntervalEndDate \"2015-02-03T00:00:00\"^^xsd:dateTime .

:since-2015 a undo:Interval ;
    ti:hasIntervalStartDate \"2015-02-03T00:00:00\"^^xsd:dateTime .

:constitutional-court-of-italy a allot:Reference .

:judge a allot:Role .
```


#### Scenario 5

A document has been in drafting from the 14th of May to the 14th of June 2016. Then, it has been under revision for the following two months, and finally published on the 1st of September 2016.

```
:a-document a undo:Document ;
    tvc:hasValue
        :document-in-drafting ,
        :document-under-revision ,
        :document-published .

:document-in-drafting a undo:ValueInTimeAndContext ;
    tvc:withValue :in-drafting ;
    tvc:atTime :in-drafting-interval .

:document-under-revision a undo:ValueInTimeAndContext ;
    tvc:withValue :under-revision ;
    tvc:atTime :under-revision-interval .

:document-published a undo:ValueInTimeAndContext ;
    tvc:withValue :published ;
    tvc:atTime :published-interval .

:in-drafting-interval a undo:Interval ;
    ti:hasIntervalStartDate \"2016-05-14T00:00:00\"^^xsd:dateTime ;
    ti:hasIntervalEndDate \"2016-06-14T00:00:00\"^^xsd:dateTime .

:under-revision-interval a undo:Interval ;
    ti:hasIntervalStartDate \"2016-06-14T00:00:00\"^^xsd:dateTime ;
    ti:hasIntervalEndDate \"2016-08-14T00:00:00\"^^xsd:dateTime .

:published-interval a undo:Interval ;
    ti:hasIntervalStartDate \"2016-09-01T00:00:00\"^^xsd:dateTime .

:in-drafting a undo:Status .

:under-revision a undo:Status .

:published a undo:Status .
```


### Competency questions

UNDO can be used for answering several questions related to the content of the documents published by the United Nations (e.g. UN Resolutions). In the following subsections we introduce some of them, and we accompany them with exemplar SPARQL queries. 

The prefixes that are used in all the SPARQL queries provided below are defined as follows:

    PREFIX : <https://w3id.org/akn/data/undo/>
    PREFIX allot: <https://w3id.org/akn/ontology/allot/>
    PREFIX oa: <http://www.w3.org/ns/oa#>
    PREFIX owl: <http://www.w3.org/2002/07/owl#>
    PREFIX undo: <https://w3id.org/akn/ontology/undo/>

#### Question 1

What are all the documents that refer to the UN resolution A/RES/47/180 of 22 December 1992?

    SELECT DISTINCT ?document
    WHERE {
        ?document allot:mentions :a-res-47-180-1992-12-22 .
    }


#### Question 2

What are all the entities referred by the UN resolution A/RES/50/100 of 2 February 1996?

    SELECT DISTINCT ?entity ?type
    WHERE {
        :a-res-50-100-1996-02-02 allot:mentions ?entity .
        ?entity a ?type .
        FILTER (?type != owl:NamedIndividual)
    }


#### Question 3

What are the documents that describes the General Assembly recalling the resolution A/RES/47/180 of 22 December 1992?

    SELECT DISTINCT ?document
    WHERE {
        ?rel a undo:Relation ;
            undo:hasProponent :general-assembly ;
            undo:hasSemantics :recall ;
            undo:hasReceiver :a-res-47-180-1992-12-22 .
        
        ?ann a undo:Annotation ;
            oa:hasBody ?rel ;
            oa:hasTarget ?document
    }


#### Question 4

What are all the terms that actually refer to the concept of taking a decision, and in which documents have been used?

    SELECT DISTINCT ?term ?document
    WHERE {
        ?term a allot:Term ;
            undo:hasRelatedConcept :taking-a-decision .
           
        ?ann a undo:Annotation ;
            oa:hasBody ?term ;
            oa:hasTarget ?document
    }


#### Question 5

What are the current roles of all the agents?

    PREFIX allot: <https://w3id.org/akn/ontology/allot/>
    PREFIX undo: <https://w3id.org/akn/ontology/undo/>
    PREFIX ti: <http://www.ontologydesignpatterns.org/cp/owl/timeinterval.owl#>
    PREFIX tvc: <http://www.essepuntato.it/2012/04/tvc/>
    
    SELECT DISTINCT ?agent ?role ?context
    WHERE {
        ?agent a undo:Agent ;
            tvc:hasValue ?value .
            
        ?value a undo:ValueInTimeAndContext ; 
            tvc:withValue ?role ;
            tvc:withinContext ?context .
        
        FILTER NOT EXISTS {
            ?value tvc:atTime/ti:hasIntervalEndDate ?time
        }
            
        ?role a allot:Role .
    }


#### Question 6

What roles have been held by Sergio Mattarella during his life?

    PREFIX : <https://w3id.org/akn/data/undo/>
    PREFIX allot: <https://w3id.org/akn/ontology/allot/>
    PREFIX undo: <https://w3id.org/akn/ontology/undo/>
    PREFIX ti: <http://www.ontologydesignpatterns.org/cp/owl/timeinterval.owl#>
    PREFIX tvc: <http://www.essepuntato.it/2012/04/tvc/>
    
    SELECT DISTINCT ?role ?context ?start ?end
    WHERE {
        :sergio-mattarella tvc:hasValue ?value .
        
        ?value a undo:ValueInTimeAndContext ; 
            tvc:withValue ?role ;
            tvc:withinContext ?context ;
            tvc:atTime ?time .
        
        ?time a undo:Interval ;
            ti:hasIntervalStartDate ?start .
         
        OPTIONAL {
            ?time ti:hasIntervalEndDate ?end
        }
        
        ?role a allot:Role .
    }


#### Question 7

How many times an agent has been assigned to a specific role?

    PREFIX allot: <https://w3id.org/akn/ontology/allot/>
    PREFIX undo: <https://w3id.org/akn/ontology/undo/>
    PREFIX ti: <http://www.ontologydesignpatterns.org/cp/owl/timeinterval.owl#>
    PREFIX tvc: <http://www.essepuntato.it/2012/04/tvc/>
    
    SELECT DISTINCT ?agent ?role ?context (count(?agent) AS ?count)
    WHERE {
        ?agent a undo:Agent ;
            tvc:hasValue ?value .
        
        ?value a undo:ValueInTimeAndContext ; 
            tvc:withValue ?role ;
            tvc:withinContext ?context .
        
        ?role a allot:Role .
    }
    GROUP BY ?agent ?role ?context


#### Question 8

Which roles are involved in particular contexts?

    PREFIX allot: <https://w3id.org/akn/ontology/allot/>
    PREFIX undo: <https://w3id.org/akn/ontology/undo/>
    PREFIX tvc: <http://www.essepuntato.it/2012/04/tvc/>
    
    SELECT DISTINCT ?context ?role
    WHERE {
        ?value a undo:ValueInTimeAndContext ;
            tvc:withValue ?role ;
            tvc:withinContext ?context .
            
        ?role a allot:Role .
    }
    

#### Question 9

What are all the statuses that have been associated to all the documents?

    PREFIX allot: <https://w3id.org/akn/ontology/allot/>
    PREFIX undo: <https://w3id.org/akn/ontology/undo/>
    PREFIX ti: <http://www.ontologydesignpatterns.org/cp/owl/timeinterval.owl#>
    PREFIX tvc: <http://www.essepuntato.it/2012/04/tvc/>
    
    SELECT DISTINCT ?document ?status ?start ?end
    WHERE {
        ?document a undo:Document ;
            tvc:hasValue ?value .
        
        ?value a undo:ValueInTimeAndContext ;
            tvc:withValue ?status ;
            tvc:atTime ?time .
        
        ?time a undo:Interval ;
            ti:hasIntervalStartDate ?start .
        
        OPTIONAL {
            ?time ti:hasIntervalEndDate ?end
        }
            
        ?status a undo:Status .
    }"""@en ;
	rdfs:label "UNDO"@en ;
	owl:versionInfo "March 8, 2017"@en ;
	dc:title "The United Nations Document Ontology (UNDO)"@en ;
	dc:creator "Silvio Peroni (http://orcid.org/0000-0003-0530-4305)" ;
	owl:priorVersion :2017-02-13 ;
	<http://purl.org/vocab/vann/preferredNamespaceUri> "https://w3id.org/akn/ontology/undo/" .
# 
# 
# #################################################################
# #
# #    Object Properties
# #
# #################################################################
# 
# 
# http://purl.org/dc/terms/language

<http://purl.org/dc/terms/language> a owl:ObjectProperty ;
	rdfs:comment "This property enables one to specify the language associated to a particular document version."@en ;
	rdfs:isDefinedBy <http://purl.org/dc/terms> ;
	rdfs:label "has language"@en .
# 
# http://purl.org/vocab/frbr/core#embodiment

frbr:embodiment a owl:ObjectProperty ;
	rdfs:isDefinedBy <http://purl.org/vocab/frbr/core> .
# 
# http://purl.org/vocab/frbr/core#exemplar

frbr:exemplar a owl:ObjectProperty ;
	rdfs:isDefinedBy <http://purl.org/vocab/frbr/core> .
# 
# http://purl.org/vocab/frbr/core#realization

frbr:realization a owl:ObjectProperty ;
	rdfs:isDefinedBy <http://purl.org/vocab/frbr/core> .
# 
# http://www.essepuntato.it/2012/04/tvc/atTime

tvc:atTime a owl:ObjectProperty ;
	rdfs:isDefinedBy <http://www.essepuntato.it/2012/04/tvc> .
# 
# http://www.essepuntato.it/2012/04/tvc/hasValue

tvc:hasValue a owl:ObjectProperty ;
	rdfs:isDefinedBy <http://www.essepuntato.it/2012/04/tvc> .
# 
# http://www.essepuntato.it/2012/04/tvc/withValue

tvc:withValue a owl:ObjectProperty ;
	rdfs:isDefinedBy <http://www.essepuntato.it/2012/04/tvc> .
# 
# http://www.essepuntato.it/2012/04/tvc/withinContext

tvc:withinContext a owl:ObjectProperty ;
	rdfs:isDefinedBy <http://www.essepuntato.it/2012/04/tvc> .
# 
# http://www.w3.org/ns/oa#hasBody

oa:hasBody a owl:ObjectProperty ;
	rdfs:isDefinedBy <http://www.w3.org/ns/oa#> .
# 
# http://www.w3.org/ns/oa#hasTarget

oa:hasTarget a owl:ObjectProperty ;
	rdfs:isDefinedBy <http://www.w3.org/ns/oa#> .
# 
# https://w3id.org/akn/ontology/allot/hasEmbodiment

<https://w3id.org/akn/ontology/allot/hasEmbodiment> rdfs:subPropertyOf frbr:embodiment .
# 
# https://w3id.org/akn/ontology/allot/hasExemplar

<https://w3id.org/akn/ontology/allot/hasExemplar> rdfs:subPropertyOf frbr:exemplar .
# 
# https://w3id.org/akn/ontology/allot/hasRealization

<https://w3id.org/akn/ontology/allot/hasRealization> a owl:ObjectProperty ;
	rdfs:subPropertyOf frbr:realization .
# 
# https://w3id.org/akn/ontology/allot/mentions

<https://w3id.org/akn/ontology/allot/mentions> a owl:ObjectProperty .
# 
# https://w3id.org/akn/ontology/undo/hasProponent

:hasProponent a owl:ObjectProperty ;
	rdfs:subPropertyOf <https://w3id.org/akn/ontology/allot/hasRelatedReference> ;
	rdfs:domain :Relation ;
	rdfs:range <https://w3id.org/akn/ontology/allot/Reference> ;
	rdfs:comment "The proponent entity of a relation."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "has proponent"@en .
# 
# https://w3id.org/akn/ontology/undo/hasReceiver

:hasReceiver a owl:ObjectProperty ;
	rdfs:subPropertyOf <https://w3id.org/akn/ontology/allot/hasRelatedReference> ;
	rdfs:domain :Relation ;
	rdfs:range <https://w3id.org/akn/ontology/allot/Reference> ;
	rdfs:comment "The receiver entity of a relation."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "has receiver"@en .
# 
# https://w3id.org/akn/ontology/undo/hasRelatedConcept

:hasRelatedConcept a owl:ObjectProperty ;
	rdfs:subPropertyOf <https://w3id.org/akn/ontology/allot/hasRelatedReference> ;
	rdfs:domain <https://w3id.org/akn/ontology/allot/Term> ;
	rdfs:range <https://w3id.org/akn/ontology/allot/Concept> ;
	rdfs:comment "A concept that is related somehow to a term (e.g. because it represents the meaning of a particular term)."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "has related concept"@en .
# 
# https://w3id.org/akn/ontology/undo/hasSemantics

:hasSemantics a owl:ObjectProperty ;
	rdfs:subPropertyOf <https://w3id.org/akn/ontology/allot/hasRelatedReference> ;
	rdfs:domain :Relation ;
	rdfs:range <https://w3id.org/akn/ontology/allot/Concept> ;
	rdfs:comment "The semantics of a relation."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "has semantics"@en .
# 
# 
# 
# #################################################################
# #
# #    Data properties
# #
# #################################################################
# 
# 
# http://www.ontologydesignpatterns.org/cp/owl/timeinterval.owl#hasIntervalEndDate

ti:hasIntervalEndDate a owl:DatatypeProperty ;
	rdfs:comment <http://www.ontologydesignpatterns.org/cp/owl/timeinterval.owl> .
# 
# http://www.ontologydesignpatterns.org/cp/owl/timeinterval.owl#hasIntervalStartDate

ti:hasIntervalStartDate a owl:DatatypeProperty ;
	rdfs:comment <http://www.ontologydesignpatterns.org/cp/owl/timeinterval.owl> .
# 
# 
# 
# #################################################################
# #
# #    Classes
# #
# #################################################################
# 
# 
# http://purl.org/dc/terms/LinguisticSystem

<http://purl.org/dc/terms/LinguisticSystem> a owl:Class ;
	rdfs:isDefinedBy <http://purl.org/dc/terms/> .
# 
# http://purl.org/spar/fabio/Expression

fabio:Expression a owl:Class ;
	rdfs:isDefinedBy <http://purl.org/spar/fabio> .
# 
# http://purl.org/spar/fabio/Item

fabio:Item a owl:Class ;
	rdfs:isDefinedBy <http://purl.org/spar/fabio> .
# 
# http://purl.org/spar/fabio/Manifestation

fabio:Manifestation a owl:Class ;
	rdfs:isDefinedBy <http://purl.org/spar/fabio> .
# 
# http://purl.org/spar/fabio/Work

fabio:Work a owl:Class ;
	rdfs:isDefinedBy <http://purl.org/spar/fabio> .
# 
# http://purl.org/spar/pro/Role

pro:Role a owl:Class ;
	rdfs:isDefinedBy <http://purl.org/spar/pro> .
# 
# http://purl.org/spar/pso/Status

pso:Status a owl:Class ;
	rdfs:isDefinedBy <http://purl.org/spar/pso> .
# 
# http://www.essepuntato.it/2012/04/tvc/ValueInTime

tvc:ValueInTime a owl:Class ;
	rdfs:isDefinedBy <http://www.essepuntato.it/2012/04/tvc> .
# 
# http://www.estrellaproject.org/lkif-core/action.owl#Agent

lkif-action:Agent a owl:Class ;
	rdfs:isDefinedBy <http://www.estrellaproject.org/lkif-core/action.owl> .
# 
# http://www.estrellaproject.org/lkif-core/action.owl#Organisation

lkif-action:Organisation a owl:Class ;
	rdfs:isDefinedBy <http://www.estrellaproject.org/lkif-core/action.owl> .
# 
# http://www.estrellaproject.org/lkif-core/action.owl#Person

lkif-action:Person a owl:Class ;
	rdfs:isDefinedBy <http://www.estrellaproject.org/lkif-core/action.owl> .
# 
# http://www.estrellaproject.org/lkif-core/role.owl#Role

lkif-role:Role a owl:Class ;
	rdfs:isDefinedBy <http://www.estrellaproject.org/lkif-core/role.owl> .
# 
# http://www.ontologydesignpatterns.org/cp/owl/timeinterval.owl#TimeInterval

ti:TimeInterval a owl:Class ;
	rdfs:isDefinedBy <http://www.ontologydesignpatterns.org/cp/owl/timeinterval.owl> .
# 
# http://www.w3.org/2002/07/owl#Thing

owl:Thing a owl:Class .
# 
# http://xmlns.com/foaf/0.1/Agent

<http://xmlns.com/foaf/0.1/Agent> a owl:Class ;
	rdfs:isDefinedBy <http://xmlns.com/foaf/0.1/> .
# 
# http://xmlns.com/foaf/0.1/Organization

<http://xmlns.com/foaf/0.1/Organization> a owl:Class ;
	rdfs:isDefinedBy <http://xmlns.com/foaf/0.1/> .
# 
# http://xmlns.com/foaf/0.1/Person

<http://xmlns.com/foaf/0.1/Person> a owl:Class ;
	rdfs:isDefinedBy <http://xmlns.com/foaf/0.1/> .
# 
# https://w3id.org/akn/ontology/allot/Concept

<https://w3id.org/akn/ontology/allot/Concept> a owl:Class ;
	rdfs:subClassOf skos:Concept ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/allot> .
# 
# https://w3id.org/akn/ontology/allot/Event

<https://w3id.org/akn/ontology/allot/Event> a owl:Class ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/allot> .
# 
# https://w3id.org/akn/ontology/allot/FRBRExpression

<https://w3id.org/akn/ontology/allot/FRBRExpression> rdfs:subClassOf fabio:Expression , _:genid1 .

_:genid1 a owl:Restriction ;
	owl:onProperty <http://purl.org/dc/terms/language> ;
	owl:qualifiedCardinality "1"^^xsd:nonNegativeInteger ;
	owl:onClass :Language .

<https://w3id.org/akn/ontology/allot/FRBRExpression> rdfs:isDefinedBy <https://w3id.org/akn/ontology/allot> .
# 
# https://w3id.org/akn/ontology/allot/FRBRItem

<https://w3id.org/akn/ontology/allot/FRBRItem> rdfs:subClassOf fabio:Item ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/allot> .
# 
# https://w3id.org/akn/ontology/allot/FRBRManifestation

<https://w3id.org/akn/ontology/allot/FRBRManifestation> rdfs:subClassOf fabio:Manifestation ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/allot> .
# 
# https://w3id.org/akn/ontology/allot/FRBRWork

<https://w3id.org/akn/ontology/allot/FRBRWork> rdfs:subClassOf fabio:Work ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/allot> .
# 
# https://w3id.org/akn/ontology/allot/Organization

<https://w3id.org/akn/ontology/allot/Organization> a owl:Class ;
	rdfs:subClassOf lkif-action:Organisation , <http://xmlns.com/foaf/0.1/Organization> , :Agent ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/allot> .
# 
# https://w3id.org/akn/ontology/allot/Person

<https://w3id.org/akn/ontology/allot/Person> rdfs:subClassOf lkif-action:Person , <http://xmlns.com/foaf/0.1/Person> , :Agent ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/allot> .
# 
# https://w3id.org/akn/ontology/allot/Reference

<https://w3id.org/akn/ontology/allot/Reference> a owl:Class ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/allot> .
# 
# https://w3id.org/akn/ontology/allot/Role

<https://w3id.org/akn/ontology/allot/Role> a owl:Class ;
	rdfs:subClassOf pro:Role , lkif-role:Role , :Value ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/allot> .
# 
# https://w3id.org/akn/ontology/allot/Term

<https://w3id.org/akn/ontology/allot/Term> a owl:Class ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/allot> .
# 
# https://w3id.org/akn/ontology/undo/Address

:Address a owl:Class ;
	rdfs:subClassOf :Communication ;
	rdfs:comment "A document exemplifying keynote speeches and opening addresses and messages."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "address"@en .
# 
# https://w3id.org/akn/ontology/undo/AdministrativeCircular

:AdministrativeCircular a owl:Class ;
	rdfs:subClassOf :AdministrativeIssuance ;
	rdfs:comment "A document containing general information of administrative nature as well as clarifications of established rules, policies and procedures."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "administrative circular"@en .
# 
# https://w3id.org/akn/ontology/undo/AdministrativeInstruction

:AdministrativeInstruction a owl:Class ;
	rdfs:subClassOf :AdministrativeIssuance ;
	rdfs:comment "A document that prescribes instructions and procedures for the implementation of rules and regulations, as well as formally communicate decisions on, for example, appointment, promotion, transfer and change of duty station."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "administrative instruction"@en .
# 
# https://w3id.org/akn/ontology/undo/AdministrativeIssuance

:AdministrativeIssuance a owl:Class ;
	rdfs:subClassOf :Document ;
	rdfs:comment "Document concerning administrative instructions and circulars. Their structures vary widely across organizations and traditions but may have the format of a formal communication with a title and content in unnumbered or numbered paragraphs or be divided into sections."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "administrative issuance"@en .
# 
# https://w3id.org/akn/ontology/undo/AdvisoryOpinion

:AdvisoryOpinion a owl:Class ;
	rdfs:subClassOf :CourtDecision ;
	rdfs:comment "A document introducing an opinion rendered by a court or adjudicating body upon request."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "advisory opinion"@en .
# 
# https://w3id.org/akn/ontology/undo/AgendaListing

:AgendaListing a owl:Class ;
	rdfs:subClassOf :MeetingAgenda ;
	rdfs:comment "A document listing agenda items to be considered at a specific meeting/s or session/s. It may report time, location, etc."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "agenda listing"@en .
# 
# https://w3id.org/akn/ontology/undo/Agent

:Agent a owl:Class ;
	rdfs:subClassOf lkif-action:Agent , <http://xmlns.com/foaf/0.1/Agent> , <https://w3id.org/akn/ontology/allot/Reference> ;
	rdfs:comment "An actor (e.g. a person, an organisation) that can perform some actions."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "agent"@en .
# 
# https://w3id.org/akn/ontology/undo/Amendment

:Amendment a owl:Class ;
	rdfs:subClassOf :ModificatoryInstruction ;
	rdfs:comment "A document that provides modifications to other normative documents. The modifications could appear in different structured texts like normative and deliberative documents, debate records, etc."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "amendment"@en .
# 
# https://w3id.org/akn/ontology/undo/AmendmentList

:AmendmentList a owl:Class ;
	rdfs:subClassOf :ModificatoryInstruction ;
	rdfs:comment "A document listing proposals for modifications submitted to official deliberative bodies for discussion. It provides modifications to other normative documents."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "amendment list"@en .
# 
# https://w3id.org/akn/ontology/undo/AnnotatedAgenda

:AnnotatedAgenda a owl:Class ;
	rdfs:subClassOf :MeetingAgenda ;
	rdfs:comment "An agenda with a brief description of agenda items, citation of related documents as well as information and other announcements."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "annotated agenda"@en .
# 
# https://w3id.org/akn/ontology/undo/Annotation

:Annotation a owl:Class ;
	rdfs:subClassOf oa:Annotation , <https://w3id.org/akn/ontology/allot/Concept> , _:genid2 .

_:genid2 a owl:Restriction ;
	owl:onProperty oa:hasBody ;
	owl:allValuesFrom <https://w3id.org/akn/ontology/allot/Reference> .

:Annotation rdfs:subClassOf _:genid3 .

_:genid3 a owl:Restriction ;
	owl:onProperty oa:hasTarget ;
	owl:allValuesFrom _:genid4 .

_:genid4 a owl:Class ;
	owl:unionOf _:genid8 .

_:genid8 a rdf:List ;
	rdf:first <https://w3id.org/akn/ontology/allot/FRBRExpression> ;
	rdf:rest _:genid7 .

_:genid7 a rdf:List ;
	rdf:first <https://w3id.org/akn/ontology/allot/FRBRItem> ;
	rdf:rest _:genid6 .

_:genid6 a rdf:List ;
	rdf:first <https://w3id.org/akn/ontology/allot/FRBRManifestation> ;
	rdf:rest _:genid5 .

_:genid5 a rdf:List ;
	rdf:first <https://w3id.org/akn/ontology/allot/FRBRWork> ;
	rdf:rest rdf:nil .

:Annotation rdfs:comment "A mechanism that allows someone to link a specific entity (e.g. a relation) to a target document (or its parts), with the intent of specifying from where that entity has been actually derived from."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "annotation"@en .
# 
# https://w3id.org/akn/ontology/undo/Bulletin

:Bulletin a owl:Class ;
	rdfs:subClassOf :Communication ;
	rdfs:comment "A document containing information not requiring any action by the addressees."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "bulletin"@en .
# 
# https://w3id.org/akn/ontology/undo/Charter

:Charter a owl:Class ;
	rdfs:subClassOf :NormativeDocument ;
	rdfs:comment "Foundational treaty outlining the conditions under which a body is organised, and defining its rights and privileges."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "charter"@en .
# 
# https://w3id.org/akn/ontology/undo/Circular

:Circular a owl:Class ;
	rdfs:subClassOf :Communication ;
	rdfs:comment "A document containing specialized information of specific interests."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "circular"@en .
# 
# https://w3id.org/akn/ontology/undo/CodeOfConduct

:CodeOfConduct a owl:Class ;
	rdfs:subClassOf :NormativeDocument ;
	rdfs:comment "A document listing rules outlining the responsibilities of, or proper practices for, individuals, parties, organizations, or countries on specific issues."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "code of conduct"@en .
# 
# https://w3id.org/akn/ontology/undo/CodeOfPractice

:CodeOfPractice a owl:Class ;
	rdfs:subClassOf :NormativeDocument ;
	rdfs:comment "A document that defines correct procedures on how to implement principles and/or standards."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "code of practice"@en .
# 
# https://w3id.org/akn/ontology/undo/Collection

:Collection a owl:Class ;
	rdfs:subClassOf :Publication ;
	rdfs:comment "A collection of individual autonomous documents."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "collection"@en .
# 
# https://w3id.org/akn/ontology/undo/Communication

:Communication a owl:Class ;
	rdfs:subClassOf :Document ;
	rdfs:comment "A document containing an official communication used to formally inform the UN community of events and of the outcome of non-UN meetings, to transmit reports or communications, and for a variety of other purposes. Its structures vary widely across organizations and traditions but generally assume the format of a formal communication with title and content in unnumbered paragraphs."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "communication"@en .
# 
# https://w3id.org/akn/ontology/undo/ConferenceReport

:ConferenceReport a owl:Class ;
	rdfs:subClassOf :MeetingReport ;
	rdfs:comment "A document summarising discussions held during a conference. It may also contain full text of resolutions or decisions, either proposed or adopted; recommended actions to be taken by other organs, etc., in the body of the document or as annexes."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "conference report"@en .
# 
# https://w3id.org/akn/ontology/undo/Constitution

:Constitution a owl:Class ;
	rdfs:subClassOf :NormativeDocument ;
	rdfs:comment "A document describing a set of fundamental principles or established precedents according to which a body is acknowledged to be governed."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "constitution"@en .
# 
# https://w3id.org/akn/ontology/undo/Convention

:Convention a owl:Class ;
	rdfs:subClassOf :NormativeDocument ;
	rdfs:comment "Mandatory regulations subject to ratification. Instruments usually negotiated under the auspices of an international organization."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "convention"@en .
# 
# https://w3id.org/akn/ontology/undo/CouncilReport

:CouncilReport a owl:Class ;
	rdfs:subClassOf :MeetingReport ;
	rdfs:comment "A document summarising discussions held during a council. It may also contain full text of resolutions or decisions, either proposed or adopted; recommended actions to be taken by other organs, etc., in the body of the document or as annexes."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "council report"@en .
# 
# https://w3id.org/akn/ontology/undo/CourtDecision

:CourtDecision a owl:Class ;
	rdfs:subClassOf :Document ;
	rdfs:comment "A document introducing a court of law or adjudicating authority formal decision or specific determination following a legal proceedings. The typical narrative of judgments is often divided in background, introduction, motivation and decision."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "court decision"@en .
# 
# https://w3id.org/akn/ontology/undo/Decision

:Decision a owl:Class ;
	rdfs:subClassOf :DeliberativeDocument ;
	rdfs:comment "A document describing a formal action regarding administrative and procedural matters of principal or subsidiary organ or other empowered bodies. This kind of documents is sometimes also used to record the adoption of a text representing the consensus of the members of a given organ."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "decision"@en .
# 
# https://w3id.org/akn/ontology/undo/DeliberativeDocument

:DeliberativeDocument a owl:Class ;
	rdfs:subClassOf :Document ;
	rdfs:comment "Formal expressions of the opinion or will of a principal or subsidiary organ or other empowered bodies. Usually they are open structure documents, sometimes articulated in hierarchical structures in which the text is subdivided into higher and lower subdivisions, generally including a preamble and operative paragraphs."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "deliberative document"@en .
# 
# https://w3id.org/akn/ontology/undo/Document

:Document a owl:Class ;
	rdfs:subClassOf <https://w3id.org/akn/ontology/allot/FRBRWork> , _:genid9 .

_:genid9 a owl:Restriction ;
	owl:onProperty <https://w3id.org/akn/ontology/allot/hasRealization> ;
	owl:someValuesFrom :DocumentVersion .

:Document rdfs:comment "A document of a specific kind (e.g. normative documents, legal documents, etc.) published by someone for certain reasons."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "document"@en .
# 
# https://w3id.org/akn/ontology/undo/DocumentVersion

:DocumentVersion a owl:Class ;
	rdfs:subClassOf <https://w3id.org/akn/ontology/allot/FRBRExpression> , _:genid10 .

_:genid10 a owl:Restriction ;
	owl:onProperty _:genid11 .

_:genid11 owl:inverseOf <https://w3id.org/akn/ontology/allot/hasRealization> .

_:genid10 owl:allValuesFrom :Document .

:DocumentVersion rdfs:subClassOf _:genid12 .

_:genid12 a owl:Restriction ;
	owl:onProperty <http://purl.org/dc/terms/language> ;
	owl:qualifiedCardinality "1"^^xsd:nonNegativeInteger ;
	owl:onClass :Language .

:DocumentVersion rdfs:comment "A particular version of a document written according to a certain language."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "document version"@en .
# 
# https://w3id.org/akn/ontology/undo/Interval

:Interval a owl:Class ;
	rdfs:subClassOf ti:TimeInterval , <https://w3id.org/akn/ontology/allot/Concept> , _:genid13 .

_:genid13 a owl:Restriction ;
	owl:onProperty ti:hasIntervalEndDate ;
	owl:allValuesFrom xsd:dateTime .

:Interval rdfs:subClassOf _:genid14 .

_:genid14 a owl:Restriction ;
	owl:onProperty ti:hasIntervalStartDate ;
	owl:allValuesFrom xsd:dateTime .

:Interval rdfs:comment "A particular time period characterised by a starting date (specified by means of the property ti:hasIntervalStartDate) and an ending date (specified by means of the property ti:hasIntervalEndDate)."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "interval"@en .
# 
# https://w3id.org/akn/ontology/undo/Judgment

:Judgment a owl:Class ;
	rdfs:subClassOf :CourtDecision ;
	rdfs:comment "A document formalising a decision or specific determination following a legal proceeding. Its structures are highly formalised."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "judgement"@en .
# 
# https://w3id.org/akn/ontology/undo/Language

:Language a owl:Class ;
	rdfs:subClassOf <http://purl.org/dc/terms/LinguisticSystem> , <https://w3id.org/akn/ontology/allot/Concept> ;
	rdfs:comment "A particular language adopted by the United Nation for publishing their documents (e.g. Arabic, Chinese, English, French, Russian, Spanish)."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "language"@en .
# 
# https://w3id.org/akn/ontology/undo/MeetingAgenda

:MeetingAgenda a owl:Class ;
	rdfs:subClassOf :Document ;
	rdfs:comment "Documents listing agenda items of a meeting or a series of meetings, at times with brief description of agenda items, citation of related documents, and other announcements, such as consultations, informal meetings or side events, as well as summaries of the previous day's meetings. Their structures vary widely across organizations and traditions."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "meeting agenda"@en .
# 
# https://w3id.org/akn/ontology/undo/MeetingMinute

:MeetingMinute a owl:Class ;
	rdfs:subClassOf :MeetingReport ;
	rdfs:comment "A document providing a third-person accounts of meetings."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "meeting minute"@en .
# 
# https://w3id.org/akn/ontology/undo/MeetingRecord

:MeetingRecord a owl:Class ;
	rdfs:subClassOf :Document ;
	rdfs:comment "Documents containing full first-person records of a meeting (verbatim). Their structure reflects the different section of the debates and/or alternation of questions and answers that take place during meetings discussions."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "meeting report"@en .
# 
# https://w3id.org/akn/ontology/undo/MeetingReport

:MeetingReport a owl:Class ;
	rdfs:subClassOf :Document ;
	rdfs:comment "Documents containing summarized accounts of meetings. Their structures vary widely across organizations and traditions."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "meeting report"@en .
# 
# https://w3id.org/akn/ontology/undo/Memoranda

:Memoranda a owl:Class ;
	rdfs:subClassOf :Communication ;
	rdfs:comment "An official written communication issued to disseminate information."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "memoranda"@en .
# 
# https://w3id.org/akn/ontology/undo/ModificatoryInstruction

:ModificatoryInstruction a owl:Class ;
	rdfs:subClassOf :Document ;
	rdfs:comment "A document containing formal proposals for modifications, as single instruction or as a collection of instructions, of previously issued documents issued by the same body that approved the original document. Its structures vary widely across organizations and traditions."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "modificatory instruction"@en .
# 
# https://w3id.org/akn/ontology/undo/NormativeDocument

:NormativeDocument a owl:Class ;
	rdfs:subClassOf :Document ;
	rdfs:comment "Formal provision concerning commands, recommendations, opinions or expressions of will issued or entered into by a principal or a subsidiary organ or other empowered bodies. Usually, it is articulated in hierarchical structures, in which the text is subdivided into higher and lower subdivisions."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "normative document"@en .
# 
# https://w3id.org/akn/ontology/undo/Note

:Note a owl:Class ;
	rdfs:subClassOf :Communication ;
	rdfs:comment "A written communication to transmit comments or reports."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "note"@en .
# 
# https://w3id.org/akn/ontology/undo/OfficialCompilation

:OfficialCompilation a owl:Class ;
	rdfs:subClassOf :Publication ;
	rdfs:comment "An authoritative compilation of official documents."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "official compilation"@en .
# 
# https://w3id.org/akn/ontology/undo/OfficialLetter

:OfficialLetter a owl:Class ;
	rdfs:subClassOf :Communication ;
	rdfs:comment "Official written correspondence; communications or notes verbale concerning issues under the authority of the organisation to provide information, requiring specific action by the addressees or stating a position."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "official letter"@en .
# 
# https://w3id.org/akn/ontology/undo/OfficialStatement

:OfficialStatement a owl:Class ;
	rdfs:subClassOf :Communication ;
	rdfs:comment "A document introducing a pronunciation of officers in their official capacity."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "official statement"@en .
# 
# https://w3id.org/akn/ontology/undo/Paper

:Paper a owl:Class ;
	rdfs:subClassOf :Document ;
	rdfs:comment "An official document that provides information about a particular subject or a detailed account of issues, policies or outcomes of, for example, inquiries or scientific investigations. Its structures vary widely across organizations and traditions."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "paper"@en .
# 
# https://w3id.org/akn/ontology/undo/Policy

:Policy a owl:Class ;
	rdfs:subClassOf :Paper ;
	rdfs:comment "A document introducing general course or principle of action adopted or proposed by the official authorities or bodies."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "policy"@en .
# 
# https://w3id.org/akn/ontology/undo/PositionPaper

:PositionPaper a owl:Class ;
	rdfs:subClassOf :Paper ;
	rdfs:comment "An essay detailing facts and opinions regarding specific issues."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "position paper"@en .
# 
# https://w3id.org/akn/ontology/undo/PressRelease

:PressRelease a owl:Class ;
	rdfs:subClassOf :Communication ;
	rdfs:comment "A written communication to the public that serves information purposes only. It is not considered an official document."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "press release"@en .
# 
# https://w3id.org/akn/ontology/undo/ProgressReport

:ProgressReport a owl:Class ;
	rdfs:subClassOf :Paper ;
	rdfs:comment "A document assessing projects or processes."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "progress report"@en .
# 
# https://w3id.org/akn/ontology/undo/Protocol

:Protocol a owl:Class ;
	rdfs:subClassOf :NormativeDocument ;
	rdfs:comment "International agreement that supplements a previous treaty or international agreement."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "protocol"@en .
# 
# https://w3id.org/akn/ontology/undo/Publication

:Publication a owl:Class ;
	rdfs:subClassOf :Document ;
	rdfs:comment "The documentary output of the process meant to share information in any form or medium."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "publication"@en .
# 
# https://w3id.org/akn/ontology/undo/Recommendation

:Recommendation a owl:Class ;
	rdfs:subClassOf :NormativeDocument ;
	rdfs:comment "A document that provides guidance and may create reporting obligations for parties."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "recommendation"@en .
# 
# https://w3id.org/akn/ontology/undo/Regulation

:Regulation a owl:Class ;
	rdfs:subClassOf :NormativeDocument ;
	rdfs:comment "A set guides to enforce a statutory instrument or regulate activities."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "regulation"@en .
# 
# https://w3id.org/akn/ontology/undo/Relation

:Relation a owl:Class ;
	rdfs:subClassOf <https://w3id.org/akn/ontology/allot/Concept> , _:genid15 .

_:genid15 a owl:Restriction ;
	owl:onProperty :hasProponent ;
	owl:cardinality "1"^^xsd:nonNegativeInteger .

:Relation rdfs:subClassOf _:genid16 .

_:genid16 a owl:Restriction ;
	owl:onProperty :hasReceiver ;
	owl:cardinality "1"^^xsd:nonNegativeInteger .

:Relation rdfs:subClassOf _:genid17 .

_:genid17 a owl:Restriction ;
	owl:onProperty :hasSemantics ;
	owl:cardinality "1"^^xsd:nonNegativeInteger .

:Relation rdfs:comment "Something that allows one to link a proponent entity to a receiver entity according to a specific semantics - e.g. saying that a document (proponent) cites (semantics) another document (receiver), or that an organization (proponent) approves (semantics) a certain document (receiver), etc."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "relation"@en .
# 
# https://w3id.org/akn/ontology/undo/Resolution

:Resolution a owl:Class ;
	rdfs:subClassOf :DeliberativeDocument ;
	rdfs:comment "A particular kind of document that contains a formal expression of the will of a principal or subsidiary organ or other empowered bodies."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "resolution"@en .
# 
# https://w3id.org/akn/ontology/undo/Rules

:Rules a owl:Class ;
	rdfs:subClassOf :NormativeDocument ;
	rdfs:comment "A document prescribing principles governing conduct or procedure within a particular area of activity."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "rules"@en .
# 
# https://w3id.org/akn/ontology/undo/RulesOfProcedure

:RulesOfProcedure a owl:Class ;
	rdfs:subClassOf :NormativeDocument ;
	rdfs:comment "A document that prescribes guides for conduct or actions, such as rules for conducting business within a body, as well as for the financial administration of organizations and their members."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "rules of procedure"@en .
# 
# https://w3id.org/akn/ontology/undo/Standard

:Standard a owl:Class ;
	rdfs:subClassOf :NormativeDocument ;
	rdfs:comment "A document introducing a set of guides established by consensus outlining the responsibilities of, or proper practices for, individuals, parties, organizations or countries on specific issues."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "standard"@en .
# 
# https://w3id.org/akn/ontology/undo/Status

:Status a owl:Class ;
	rdfs:subClassOf pso:Status , :Value ;
	rdfs:comment "A value identifying the status of a document (e.g. in drafting, under revision, published)."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "status"@en .
# 
# https://w3id.org/akn/ontology/undo/Treaty

:Treaty a owl:Class ;
	rdfs:subClassOf :NormativeDocument ;
	rdfs:comment "An international agreement concluded between States, and bilateral or multilateral agreements governed by international law to which international organizations are parties."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "treaty"@en .
# 
# https://w3id.org/akn/ontology/undo/Value

:Value a owl:Class ;
	rdfs:subClassOf <https://w3id.org/akn/ontology/allot/Reference> ;
	rdfs:comment "Something that can be held by an entity (e.g. a particular role or status)."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "value"@en .
# 
# https://w3id.org/akn/ontology/undo/ValueInTimeAndContext

:ValueInTimeAndContext a owl:Class ;
	rdfs:subClassOf tvc:ValueInTime , <https://w3id.org/akn/ontology/allot/Concept> , _:genid18 .

_:genid18 a owl:Restriction ;
	owl:onProperty tvc:atTime ;
	owl:allValuesFrom :Interval .

:ValueInTimeAndContext rdfs:subClassOf _:genid19 .

_:genid19 a owl:Restriction ;
	owl:onProperty tvc:withValue ;
	owl:allValuesFrom :Value .

:ValueInTimeAndContext rdfs:subClassOf _:genid20 .

_:genid20 a owl:Restriction ;
	owl:onProperty tvc:withinContext ;
	owl:allValuesFrom <https://w3id.org/akn/ontology/allot/Reference> .

:ValueInTimeAndContext rdfs:subClassOf _:genid21 .

_:genid21 a owl:Restriction ;
	owl:onProperty _:genid22 .

_:genid22 owl:inverseOf tvc:hasValue .

_:genid21 owl:allValuesFrom <https://w3id.org/akn/ontology/allot/Reference> .

:ValueInTimeAndContext dc:description """This class is based on a particular ontology pattern called Time-indexed Value in Context (http://www.essepuntato.it/2012/04/tvc). It has been used by several ontologies for describing values that can be assigned/held by an entity at different times and according to different contexts. Notable ontologies that are using it are the Publishing Roles Ontology (PRO, http://purl.org/spar/pro) and the Publishing Status Ontology (PSO, http://purl.org/spar/pso).

More information are available at the following paper:

Peroni, S., Shotton, D., Vitali, F. (2012). Scholarly publishing and the Linked Data: describing roles, statuses, temporal and contextual extents. In Sack, H., Pellegrini, T. (Eds.), Proceedings of the 8th International Conference on Semantic Systems (i-Semantics 2012): 9-16. New York, New York, USA: ACM. DOI: http://dx.doi.org/10.1145/2362499.2362502 (Open Access version available at http://speroni.web.cs.unibo.it/publications/peroni-2012-scholarly-publishing-linked.pdf)"""@en ;
	rdfs:comment "The situation that involves an entity (with the object property tvc:hasValue) having a particular value (tvc:withValue) associated during a certain time interval (tvc:atTime) and within a specific context (tvc:withinContext)."@en ;
	rdfs:isDefinedBy <https://w3id.org/akn/ontology/undo> ;
	rdfs:label "value in time and context"@en .
# 
# 
# 
# #################################################################
# #
# #    Individuals
# #
# #################################################################
# 
# 
# http://id.loc.gov/vocabulary/iso639-1/ar

lan:ar a owl:NamedIndividual , :Language ;
	dc:description "This entity representing the Arabic language has been originally defined in the Library of Congress concept scheme (skos:ConceptScheme) available at http://id.loc.gov/vocabulary/iso639-1, which maps all the two-letters codes for languages introduced in the specification ISO 639-1 as Linked Open Data."@en ;
	rdfs:comment "The Arabic is one of the languages used for publishing United Nations documents."@en ;
	rdfs:isDefinedBy <http://id.loc.gov/vocabulary/iso639-1> ;
	rdfs:label "Arabic"@en .
# 
# http://id.loc.gov/vocabulary/iso639-1/en

lan:en a owl:NamedIndividual , :Language ;
	dc:description "This entity representing the English language has been originally defined in the Library of Congress concept scheme (skos:ConceptScheme) available at http://id.loc.gov/vocabulary/iso639-1, which maps all the two-letters codes for languages introduced in the specification ISO 639-1 as Linked Open Data."@en ;
	rdfs:comment "The English is one of the languages used for publishing United Nations documents."@en ;
	rdfs:isDefinedBy <http://id.loc.gov/vocabulary/iso639-1> ;
	rdfs:label "English"@en .
# 
# http://id.loc.gov/vocabulary/iso639-1/es

lan:es a owl:NamedIndividual , :Language ;
	dc:description "This entity representing the Spanish language has been originally defined in the Library of Congress concept scheme (skos:ConceptScheme) available at http://id.loc.gov/vocabulary/iso639-1, which maps all the two-letters codes for languages introduced in the specification ISO 639-1 as Linked Open Data."@en ;
	rdfs:comment "The Spanish is one of the languages used for publishing United Nations documents."@en ;
	rdfs:isDefinedBy <http://id.loc.gov/vocabulary/iso639-1> ;
	rdfs:label "Spanish"@en .
# 
# http://id.loc.gov/vocabulary/iso639-1/fr

lan:fr a owl:NamedIndividual , :Language ;
	dc:description "This entity representing the French language has been originally defined in the Library of Congress concept scheme (skos:ConceptScheme) available at http://id.loc.gov/vocabulary/iso639-1, which maps all the two-letters codes for languages introduced in the specification ISO 639-1 as Linked Open Data."@en ;
	rdfs:comment "The French is one of the languages used for publishing United Nations documents."@en ;
	rdfs:isDefinedBy <http://id.loc.gov/vocabulary/iso639-1> ;
	rdfs:label "French"@en .
# 
# http://id.loc.gov/vocabulary/iso639-1/ru

lan:ru a owl:NamedIndividual , :Language ;
	dc:description "This entity representing the Russian language has been originally defined in the Library of Congress concept scheme (skos:ConceptScheme) available at http://id.loc.gov/vocabulary/iso639-1, which maps all the two-letters codes for languages introduced in the specification ISO 639-1 as Linked Open Data."@en ;
	rdfs:comment "The Russian is one of the languages used for publishing United Nations documents."@en ;
	rdfs:isDefinedBy <http://id.loc.gov/vocabulary/iso639-1> ;
	rdfs:label "Russian"@en .
# 
# http://id.loc.gov/vocabulary/iso639-1/zh

lan:zh a owl:NamedIndividual , :Language ;
	dc:description "This entity representing the Chinise language has been originally defined in the Library of Congress concept scheme (skos:ConceptScheme) available at http://id.loc.gov/vocabulary/iso639-1, which maps all the two-letters codes for languages introduced in the specification ISO 639-1 as Linked Open Data."@en ;
	rdfs:comment "The Chinese is one of the languages used for publishing United Nations documents."@en ;
	rdfs:isDefinedBy <http://id.loc.gov/vocabulary/iso639-1> ;
	rdfs:label "Chinese"@en .
# 
# Generated by the OWL API (version 4.2.6.20160910-2108) https://github.com/owlcs/owlapi
